In [1]:
import pandas as pd
df = pd.read_csv("titanic14.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target=df.Survived

In [24]:
inputs=df.drop('Survived', axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [25]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [26]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

# I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female

In [27]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [29]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [31]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [32]:
inputs.Age= inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [33]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test= train_test_split(inputs, target, test_size=0.3)

In [34]:
from sklearn.naive_bayes import GaussianNB
model= GaussianNB()

In [35]:
model.fit(X_train, y_train)

GaussianNB()

In [36]:
model.score(X_test, y_test)

0.7723880597014925

In [37]:
X_test[0:10]

     Pclass        Age     Fare  female
719       3  33.000000   7.7750       0
208       3  16.000000   7.7500       1
718       3  29.699118  15.5000       0
612       3  29.699118  15.5000       1
119       3   2.000000  31.2750       1
93        3  26.000000  20.5750       0
869       3   4.000000  11.1333       0
189       3  36.000000   7.8958       0
302       3  19.000000   0.0000       0
63        3   4.000000  27.9000       0

In [38]:
y_test[0:10]

719    0
208    1
718    0
612    1
119    0
93     0
869    1
189    0
302    0
63     0
Name: Survived, dtype: int64

In [39]:
model.predict(X_test[0:10])

array([0, 1, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [40]:
model.predict_proba(X_test[0:10])

array([[0.96275289, 0.03724711],
       [0.28803792, 0.71196208],
       [0.96218919, 0.03781081],
       [0.36851299, 0.63148701],
       [0.16972023, 0.83027977],
       [0.95930936, 0.04069064],
       [0.91573942, 0.08426058],
       [0.96374049, 0.03625951],
       [0.94709598, 0.05290402],
       [0.91142061, 0.08857939]])

# Calculate the score using cross validation

In [41]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.776     , 0.784     , 0.752     , 0.77419355, 0.80645161])